app/controllers/books_controller.rb

INSERT INTO "books" ("name", "author", "pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cyberstorm"], ["author", "Matthew Mather"], ["pages", 500], ["created_at", "2015-11-13 00:49:25.857394"], ["updated_at", "2015-11-13 00:49:25.857394"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "name" = ?, "pages" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Nova York"], ["pages", 999999], ["updated_at", "2015-11-15 23:34:05.444696"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)